{"id":100675,"xmlId":"com.google.gct.core","name":"Cloud Code","description":"<p>Cloud Code helps you write, deploy, and debug cloud native, Kubernetes, Cloud Run, and App Engine applications\nquickly and easily, and adds support for many Google Cloud Platform features. Create, update, and maintain Kubernetes resource files within\nIntelliJ. Build an accelerated feedback loop between your local machine and development cluster.\nRun Kubernetes wherever works best for you — whether in a local cluster or in the cloud. Deploy your Cloud Run applications to Cloud Run\nfully managed or Anthos on GKE.<br>\n<br>\nUse templates available with Cloud Code for IntelliJ to quickly define Kubernetes resource files.\nDeploy Java back ends for your cloud apps to App Engine. Use hosted Git repos on Google Cloud\nPlatform with Cloud Code for IntelliJ to store source code with your deployed services.\nYou can also use Cloud Debugger for real-time debugging of your cloud back end.</p>\n<h2>Key Features</h2>\n<ul>\n<li>Kubernetes deployment in all JetBrains IDEs</li>\n<li>Kubernetes config-free debugging for Java, Kotlin, Node.js, and Go</li>\n<li>Kubernetes log streaming integrated with deployment and debugging</li>\n<li>Cloud Run deployment to either Cloud Run fully managed or Cloud Run for Anthos (GKE)</li>\n<li>Cloud Run local emulator</li>\n<li>Cloud Run service browser</li>\n<li>Editing support for various configuration files including Cloud Build, Kustomize, and Kubernetes</li>\n<li>Kubernetes cluster browser</li>\n<li>Google Cloud API management</li>\n<li>Google Cloud Storage browser</li>\n<li>Google Cloud Source Repository integration</li>\n<li>Google Cloud Debugger integration</li>\n<li>Google Cloud Secret Manager integration</li>\n<li>Automatically installs key Kubernetes CLI dependencies and the Google Cloud SDK</li>\n<li>Automatically uses your Cloud SDK credentials</li>\n</ul>\n<p>Refer to <a href=\"https://cloud.google.com/code/docs/intellij/\">Google Cloud Code documentation</a> for more information.</p>\n<p>To help improve the Cloud Code plugin, feature usage statistics are collected and sent to\nGoogle. You can opt-out at any time by visiting Settings &gt; Cloud Code &gt; Usage Tracking. Your\nuse of this plugin is subject to the <a href=\"https://policies.google.com/privacy\">Google Privacy Policy</a>.</p>\n","tags":["Cloud Support"],"vendor":"Google Cloud","version":"20.10.1-202","notes":"<h2>Version 20.10.1 - Current Release</h2>\n<h3>New Features</h3>\n<ul>\n<li>\n<p><strong>Secret Manager support:</strong> Many applications require credentials to connect to a database, API keys to invoke a service, or certificates for authentication. Cloud Code now integrates with Google Cloud's Secret Manager to make it easy to create, view, update, and use secrets from within your IDE so you can keep this sensitive data out of your codebase and keep your applications secure.</p>\n<ul>\n<li>\n<p>View secrets, their versions, permissions, and properties in the Secret Manager panel. Easily leverage secrets from your application using our step-by-step guide in the “Code” tab.</p>\n<p></p>\n</li>\n<li>\n<p>Create secrets by either right-clicking highlighted text within the editor and selecting <strong>Create Secret in Secret Manager…</strong>, or by clicking the <strong>+</strong> button in the Secret Manager panel.</p>\n<p></p>\n</li>\n<li>\n<p>Leverage the Google Cloud libraries browser to enable the Secret Manager API and import the Secret Manager client library in order to access secrets in your application.</p>\n<p></p>\n</li>\n</ul>\n</li>\n<li>\n<p><strong>Revamped Google login experience</strong>: Login state is now synced between your IDE and command line, allowing you to log in through either.</p>\n</li>\n<li>\n<p>Cloud Code configures Cloud SDK <a href=\"https://cloud.google.com/sdk/gcloud/reference/auth/application-default\">Application Default Credentials</a> when you log in through your IDE to enable a seamless Google API authentication experience when developing locally (including Minikube and the Cloud Run local emulator), without you needing to download service account files or manually configure environment variables.</p>\n</li>\n</ul>\n<h3>Updates</h3>\n<ul>\n<li>\n<p>Reorganized the <strong>Tools &gt; Cloud Code</strong> menu to make Cloud Code actions easier to find.</p>\n<p></p>\n</li>\n<li>\n<p>Removed the Google account management component from the main IDE toolbar. Use a project selector or the <strong>Tools &gt; Cloud Code</strong> menu to sign in and out of Google Cloud.</p>\n</li>\n<li>\n<p>Improved <strong>Cloud Run (fully managed)</strong> support:</p>\n<ul>\n<li>Deploy Cloud Run services from your IDE to these newly added regions. View the full supported list <a href=\"https://cloud.google.com/run/docs/locations\">here</a>:\n<ul>\n<li><code>asia-east2</code> (Hong Kong)</li>\n<li><code>asia-northeast3</code> (Seoul, South Korea)</li>\n<li><code>asia-southeast2</code> (Jakarta)</li>\n<li><code>asia-south1</code> (Mumbai, India)</li>\n<li><code>europe-west2</code> (London, UK)</li>\n<li><code>europe-west3</code> (Frankfurt, Germany)</li>\n<li><code>europe-west6</code> (Zurich, Switzerland)</li>\n<li><code>southamerica-east1</code> (São Paulo, Brazil)</li>\n</ul>\n</li>\n<li>Allocate up to 4 vCPUs to container instances with the increased limit.</li>\n<li>Allocate up to 4GiB of memory to your services with the increased quota.</li>\n</ul>\n</li>\n</ul>\n<h3>Fixes</h3>\n<ul>\n<li><a href=\"https://github.com/GoogleCloudPlatform/cloud-code-intellij/issues/2827\">Issue #2827</a>: Fixed an issue where Cloud Code previously prompted to upgrade to an older version of the Skaffold schema.</li>\n</ul>\n<h2>Version 20.9.1</h2>\n<p><strong>Note:</strong> Cloud Code now supports the 2020.3 EAP.</p>\n<h3>New Features</h3>\n<ul>\n<li>\n<p>Kubernetes Explorer support for cluster addition: Add in existing Google Kubernetes Engine (GKE) clusters with the Cloud Code Kubernetes Explorer.</p>\n<p></p>\n<p></p>\n</li>\n<li>\n<p>Automatic Skaffold schema upgrades: Cloud Code detects Skaffold schemas that aren’t up-to-date and prompts (via the Event Log) when a Skaffold schema version upgrade is available for existing Skaffold YAML configuration files.</p>\n<p></p>\n</li>\n<li>\n<p>Alternatively, navigate to Tools &gt; Cloud Code &gt; Kubernetes and select the Check for Skaffold Schemas Upgrades menu item to check for available schema upgrades.</p>\n<p></p>\n</li>\n<li>\n<p>Spring GCP Java Libraries for Cloud APIs: Choose between recommended Google Client Java Libraries and Spring GCP Java libraries for all supported Cloud APIs with the Manage Google Cloud APIs dialog.</p>\n<p></p>\n</li>\n</ul>\n<h3>Updates</h3>\n<ul>\n<li>\n<p>Cloud Code Welcome and Release Notes screens now allow creating new sample applications for Cloud Run and Kubernetes.</p>\n<p></p>\n</li>\n<li>\n<p>The list of available APIs within the Manage Google Cloud APIs dialog is now searchable.</p>\n<p></p>\n</li>\n<li>\n<p>Cloud Code provides documentation links for all supported languages for a selected Cloud API.</p>\n<p></p>\n</li>\n<li>\n<p>Improved presentation for builders in Cloud Run and Kubernetes run configurations.</p>\n<p></p>\n</li>\n<li>\n<p>Cloud Run Explorer and Kubernetes Explorer have their root node expanded by default, making it easier to see the Kubernetes cluster list and Cloud Run services list.</p>\n<p></p>\n</li>\n</ul>\n<h3>Fixes</h3>\n<ul>\n<li>Fixed Cloud Run checks to ensure the presence of all required components when a custom Cloud SDK is used.</li>\n<li>Improved Cloud Run deployment logs.</li>\n<li>Improved user experience for project selection dialog.</li>\n</ul>\n","dependencies":["com.intellij.modules.lang","org.jetbrains.plugins.terminal","org.jetbrains.plugins.yaml","com.intellij.modules.vcs","Git4Idea"],"optionalDependencies":["com.intellij.modules.java","org.jetbrains.idea.maven","org.jetbrains.plugins.go","com.intellij.gradle","com.intellij.javaee.app.servers.integration","JavaScriptDebugger","org.jetbrains.kotlin"],"since":"202.0","until":"203.*","size":37288960}