{"id":32111,"xmlId":"Code Navigator","name":"Code Navigator","description":"Understanding other people's code or your own code in complex systems is a challenging problem in software development. This plugin supports developers in learning the dependencies and couplings in object oriented systems.   Three major plugin-functions can be used: \n<ul> \n <li>class cloud diagram</li> \n <li>graphical navigation between dependent classes</li> \n <li>creation of UML diagrams</li> \n</ul>  The class cloud diagram should be used as a first step when trying to understand an object oriented system. It shows all project classes in a single diagram as a cloud, very similar to tag clouds known from web-applications. Some of the most important classes can such be found by using the class cloud to be further investigated by using the graphical navigator or the source code.   Graphical navigation can be used to find and understand all dependencies (using classes, used classes, extending classes and extended classes of some subject class).   As soon as the developer has understood which classes interact in which way, UML diagrams should be created that condense this knowledge. Though it is really helpful to have at least some UML diagrams, many software systems are not documented well or the existing diagrams are totally outdated. This plugin helps to create static class diagrams that always can be kept in sync with the current state of a system.   The new functions can be accessed by a new menu item in the Analyze menu of the main menu bar (\n<i>Analyze Class Cloud</i>) and two new menu items in the project view and editor popup menus (\n<i>Show in Graphical Navigator</i> and \n<i>Add to UML Diagram</i>).","tags":["Code tools"],"vendor":"Frank Gerberding","version":"1.3","notes":"Version 1.3: \n<ul> \n <li> Updated plugin to work with IDEA 2016.3. </li> \n</ul> Version 1.27: \n<ul> \n <li> fixed: removed function calls to API methods that do not exist anymore. </li> \n</ul> Version 1.26(_8): \n<ul> \n <li> fixed: Path2D.Float is not used anymore, so Mac OS X users should be happy, again. </li> \n</ul> Version 1.25(_8): \n<ul> \n <li> fixed: minor bug fixes. </li> \n <li> added: many NotNull- and Nullable-checks to further improve stability. </li> \n <li> added: Thumbnail generation for diagrams and graphs </li> \n <li> added: Source code, generated javadoc and UML class diagrams </li> \n</ul> Version 1.24(_8): \n<ul> \n <li> added: search scope can be chosen for class cloud analysis. </li> \n <li> added: UML diagrams can now be saved as graphml-files (to be opened and layouted with tools like yed, see <a href=\"http://www.yworks.com\" rel=\"nofollow\">www.yworks.com</a>). </li> \n <li> changed: recompiled all classes with target 1.5, so plugin should be usable for Mac OS X users, too. </li> \n</ul>  Version 1.23(_8): \n<ul> \n <li> added: undo in diagram creation step editor </li> \n</ul> Version 1.22(_8): \n<ul> \n <li> changed: class cloud and graphical navigator graphs are saved with same writer as used for UML diagrams so always a good image quality is achieved </li> \n <li> added: class cloud diagrams, graphical navigator graphs and UML diagrams can now be saved as SVG files. These vector graphics files can be opened by tools like Inkscape (see <a href=\"http://www.inkscape.org/\" rel=\"nofollow\">www.inkscape.org</a>) </li> \n</ul> Version 1.21: \n<ul> \n <li> changed: if diagrams are saved to image files (JPG, PNG, GIF), the images will have a resolution that matches the diagrams size in world coordinates and thus are always readable </li> \n <li> added: dialog to manually edit diagram creation steps for UML diagrams </li> \n</ul> Version 1.20: \n<ul> \n <li> added: class cloud diagram that shows all classes of complete project in a single diagram to find starting points for graphical navigation in order to understand dependencies. Works similar to tag clouds, but for classes. </li> \n <li> added: class cloud tool window will be opened on demand after a class cloud is computed. If a user selects \"Analyze Class Cloud\" from the main analyze-menu, all dependencies between all classes will be analyzed and a new tool window will be opened. </li> \n <li> added: navigation from class in class cloud to graphical navigator </li> \n <li> added: tool tips in class cloud show fully qualified class name </li> \n <li> added: navigation from class in class cloud to source code (class source will be shown in editor) </li> \n <li> added: text input field in class cloud can be used to highlight matching classes in class cloud </li> \n <li> added: added reset view button to class cloud toolbar </li> \n <li> changed: added new settings for class cloud and rearranged settings dialog </li> \n <li> changed: no new layout will be computed automatically when removing classes from UML diagrams </li> \n</ul> Version 1.17: \n<ul> \n <li> changed: UML diagrams will now be updated for rename class/package and move class/package refactorings and for corresponding undo operations of rename and move refactorings </li> \n</ul> Version 1.16: \n<ul> \n <li> fixed: some minor bugs </li> \n <li> changed: suggested diagram name for new UML diagrams is now based on selected classes </li> \n</ul> Version 1.15: \n<ul> \n <li> fixed: in some cases on slow machines, the graphical navigator did not repaint node labels at the end of an animation </li> \n <li> fixed: graphical navigator did not always repaint properly on first opening tool window </li> \n <li> added: new action \"jump to graphical navigator\" jumps directly to chosen class, shortcut is \"ctrl alt shift G\" </li> \n <li> added: graphical navigator draws direct cyclic dependencies between classes in red. Can be disabled in settings dialog. </li> \n <li> added: visibility of field and method compartments can be changed via node popup menu in UML diagrams. </li> \n</ul> Version 1.14: \n<ul> \n <li> fixed: saved diagrams could only be loaded explicitly, if at least one diagram existed </li> \n <li> added: UML diagram node popup menu items for connecting nodes with more control </li> \n <li> added: UML diagram edge popup menu items for removing multiple edges at once </li> \n <li> changed: reorganized UML diagram node popup menu </li> \n <li> added: if a package is added to a UML diagram, all contained classes are added instead </li> \n <li> changed: if an opened diagram already exists, the user will be asked whether to replace, skip or rename the diagram instead of always renaming it </li> \n <li> fixed: rename button in UML diagram tool window toolbar throwed exception, if no diagram existed </li> \n <li> fixed: \"add to new diagram\" menu item throwed exception, if IDEA does not use JDK 6 (for example on Macs) </li> \n <li> added: \"add to new diagram\" menu item and \"show in graphical navigator\" menu item are now also accessible from editor tab popup menu </li> \n</ul> Version 1.13: \n<ul> \n <li> changed: persistence of settings and diagrams now uses PersistentStateComponent instead of JDOMExternalizable </li> \n <li> added: added access to settings dialog from graphical navigator and UML diagram tool windows </li> \n <li> added: one or all diagrams can now be explicitly saved to diagram creation command sequence files as XML </li> \n <li> added: diagrams can now be explicitly loaded from diagram creation command sequence files </li> \n <li> added: class in current editor is shown in graphical navigator, if tool window is opened for the first time instead of showing an empty graphical navigator window </li> \n <li> changed: classes in UML diagrams now show self references for fields </li> \n</ul> Version 1.12: \n<ul> \n <li> changed: icon handling refactored </li> \n <li> added: Help Dialogs in Graphical Navigator tool window and UML Diagrams tool window </li> \n</ul> Version 1.11: \n<ul> \n <li> changed: multiple selected classes in project view can be added to UML diagrams with a single action </li> \n <li> fixed: default colors for classes, interfaces, abstract classes and enums fixed </li> \n</ul> Version 1.10: \n<ul> \n <li> added: printing and print preview of graphical navigator </li> \n <li> added: UML diagram generator </li> \n</ul> Version 1.04: \n<ul> \n <li> fixed: graph was not repainted when stepping back or forward in navigation history with animations turned off </li> \n <li> changed: settings moved from project to application </li> \n <li> changed: refactoring of action handling </li> \n <li> added: export of current graph as image (PNG, GIF, JPEG) </li> \n</ul> Version 1.03: \n<ul> \n <li> added: buttons to zoom in, zoom out, fit contents </li> \n <li> added: hand cursor on nodes and edges indicates possible clicks </li> \n <li> added: tooltips on nodes show fully qualified class names </li> \n <li> fixed: graph is immediately updated after class visibility (non-project classes or test classes) changes </li> \n</ul> Version 1.02: \n<ul> \n <li> fixed: non-project classes no longer show other non-project classes as used classes </li> \n</ul> Version 1.01: \n<ul> \n <li> added: setting \"show non-project classes\" </li> \n <li> added: setting \"show test classes\" </li> \n <li> fixed: classes that contained inner class, that use the subject class where added as using classes </li> \n</ul>","since":"145.0","sourceCodeUrl":"https://plugins.jetbrains.com/files/3202/sourceCode.zip","size":1891040}