{"id":6763,"xmlId":"JavaDoc Sync Plugin 8","name":"JavaDoc Sync Plugin 8","description":"\n        The JavaDoc Sync Plugin will assist you to keep your\n        JavaDoc in sync between interface definitions and the\n        implementations, or method definitions and method overrides.\n        The plugin now uses template based generation of JavaDoc, so\n        that the JavaDoc text can now easily be customized to your needs.<br><br>\n\n        The JavaDoc Sync Plugin was originally written by Raymond Brandon but was updated for IntelliJ 8 by\n        Daniel Bingham <br><br>\n\n        The JavaDoc Sync Plugin can: <br>\n        <ul>\n        <li>highlight methods that define the @inheritDoc tag but there's no super method</li>\n        <li>highlight methods that define the @inheritDoc tag but the super method doesn't have javaDoc</li>\n        <li>highlight a class if one or more methods do not define JavaDoc</li>\n        <li>Generate JavaDoc for all methods that do not define JavaDoc according to user defined templates</li>\n        <li>Ignore methods that do not match the configured access modifier level</li>\n        <li>Ignore overridden methods of anonymous classes or inner classes</li>\n        <li>highlight methods that do not have JavaDoc</li>\n        <li>highlight fields that do not have JavaDoc</li>\n        <li>highlight methods of interface implementations of which\n        the JavaDoc differs from the JavaDoc defined at interface level</li>\n        <li>highlight overridden methods/constructors of which\n        the JavaDoc differs from the JavaDoc defined in the super classes</li>\n        </ul>\n        <br>\n        When the JavaDoc Sync Plugin detects differences between the\n        defining interface or base method and the implementing or\n        overriding method, the user will get quick fixes presented to\n        update the JavaDoc like:<br>\n        <ul>\n        <li>Copy JavaDoc from parent</li>\n        <li>Move to parent and introduce reference</li>\n        <li>Replace parent JavaDoc</li>\n        <li>Generate JavaDoc from signature</li>\n        <li>Generate JavaDoc from field</li>\n        <li>Generate JavaDoc for all methods</li>\n        </ul>\n        <br>\n        To turn on the JavaDoc Sync plugin, go to Settings->Errors and select \"JavaDoc issues\"\n    ","tags":["Code tools"],"vendor":"Daniel Bingham","version":"2.0.1","notes":"\n        07 Apr 2009 Bug fix release, tested against 8.1(9732):<br>\n        <ul>\n        <li>Fixes StringIndexOutOfBoundsException when checking for reference to parent method.\n        <li>Fixes incorrectly formatted Regular Expression when method arguments contained square brackets (i.e. \"[]\")\n        </ul>\n        04 Oct 2008 Updated to use the changed plugin API with IntelliJ 8.<br>\n        <ul>\n        <li>This update breaks backwards compatibility with previous IntelliJ versions.\n        </ul>\n        10 Aug 2007 Bug fix release, tested against 6.0.5(6180):<br>\n        <ul>\n        <li>Fixed duplicate introduce reference option.\n        <li>//TODO Fix JavaDoc insertion is reformatted automatically causing it not to match with parent anymore.\n        </ul>\n        14 Jul 2007 Bug fix release, tested against 6.0.5(6180):<br>\n        <ul>\n        <li>Fixed NullPointerException when generating reference for method of anonymous class.\n        </ul>\n        11 Jul 2007 Added functionality, tested against 6.0.5(6180):<br>\n        <ul>\n        <li>New feature: support @inheritDoc tag. Verifies that parent has JavaDoc and highlights method if parent\n        doesn't.</li>\n        <li>New feature: generate JavaDoc for all methods at once at class level</li>\n        <li>New feature: configurable detection level for methods so that only methods with a certain access\n        modifier are checked for JavaDoc</li>\n        <li>New feature: Ability to ignore methods of anonymous classes and inner classes</li>\n        </ul>\n        13 Mar 2007 Bug fixes and added functionality, tested against 6.0.4(6148):<br>\n        <ul>\n        <li>New feature: use templates to allow customization of generated JavaDoc.</li>\n        <li>Bug: Generate JavaDoc for interface mentions class instead of interface</li>\n        <li>Bug: Depth first in finding super method causes wrong methods in interface hierarchy to be compared\n        during inconsistency checks</li>\n        <li>Known issue: Generating JavaDoc for Enum types fails</li>\n        </ul>\n        23 Jan 2007 Bug fixes and added functionality, tested against 6.0.2(6107) and 6.0.4(6148):<br>\n        <ul>\n        <li>Bug: Description of class implementing interface method without JavaDoc is \"Overridden method\n        does not have javadoc\" instead of \"Method implementation does not have JavaDoc\"</li>\n        <li>Bug: Description of interface extending other interface and overriding method declaration without\n        JavaDoc is \"Method implementation does not have JavaDoc\" instead of \"Overridden method does not\n        have JavaDoc\"</li>\n        <li>Bug: Insertion of JavaDoc reference is mangled;</li>\n        <li>Bug: JavaDoc reference is not recognized when it contains qualified package although class is in same\n        package as referenced class;</li>\n        <li>Bug: Constructor without JavaDoc is interpreted as overridden method;</li>\n        <li>Bug: Classes that extend each other should not need to have identical JavaDoc in constructors;</li>\n        <li>Reported bug by Henne Huhu: NullPointerException while editing in Jsp;</li>\n        <li>New feature: Inspection of missing JavaDoc on class level</li>\n        <li>New feature: \"Add reference to parent\" to solve inconsistent JavaDoc between two methods and\n        keeping the exsisting JavaDoc</li>\n        </ul>\n        23 Dec 2006 Update to IntelliJ 6.0, including bug fixes and publication to plugins.intellij.net<br>\n        27 Dec 2005 Initial build for IntelliJ 5.0<br>\n    ","since":"80.8823","size":80532}