{"id":72995,"xmlId":"com.xiaohansong.codemaker","name":"CodeMaker","description":"\n    <p>This plugin generates code from right click 'Generate...' menu while focused\n    on a java/scala class. The output class can be customized using a provided velocity template to format\n    the code based on the origin class and optional selected classes. There are many features are contribute\n    by Dmitry Karlinsky and I appreciate that.</p>\n    <p>The following features are available: </p>\n    <ul>\n      <li>Support add custom template to generate codes.(Velocity templates and groovy templates)</li>\n      <li>Generate the model class for the persistent class.</li>\n      <li>Generate the converter class for the model class and the persistent class.</li>\n      <li>Generate @see doc for override method</li>\n      <li>Generate Api table to clipboard (html or markdown format)</li>\n      <li>Generate the class field from api table in clipboard</li>\n    </ul>\n    <p>If you want to add variables into template context, you can modified the source and package the plugin to meet your needs. See <a href=\"https://github.com/x-hansong/CodeMaker/blob/master/README.md#advance\">README</a></p>\n    ","tags":["Code tools"],"vendor":"Personal","version":"1.4.1","notes":"\n    <ul>\n      <li>version 1.0</li>\n      <li>version 1.1<br>\n        add action \"Generate @see doc for override method\"<br>\n      </li>\n      <li>version 1.2<br>\n        Added Scala support. Thanks to @dkarlinsky<br>\n        Support selecting destination source root for the generated class. Thanks to @dkarlinsky<br>\n        Support custom the generate file encoding<br>\n      </li>\n      <li>version 1.3<br>\n        Support generate api table for the class fields and paste it to the clipboard (html or markdown format)\n        Support generate the class fields from the api table in clipboard\n      </li>\n      <li>version 1.4 (New features are contributed by Dmitry Karlinsky.)<br>\n        Support for groovy templates (similar to GSP, based on GStringTemplateEngine)<br>\n        Templates editor screen reworked.<br>\n        Added target language selector, per template.<br>\n        Added \"test template\" functionality based on selectable test inputs, currently Java class and Scala case class.<br>\n        Added Kotlin support to the build and refactored out some logic and UI to Kotlin classes<br>\n      </li>\n    </ul>\n    \n    ","dependencies":["com.intellij.modules.java"],"optionalDependencies":["org.intellij.scala"],"since":"183.2407.10","sourceCodeUrl":"https://github.com/x-hansong/CodeMaker","size":296613}