{"id":95431,"xmlId":"com.alibabacloud.intellij.toolkit-intellij","name":"Alibaba Cloud Toolkit","description":"\n<h4>Alibaba Cloud Toolkit is a plugin for IDEs such as Eclipse or IntelliJ IDEA. Help developers develop more efficiently , test, diagnose, and deploy applications that are suitable for cloud operations.</h4>\n<h4>Why use Alibaba Cloud Toolkit?</h4>\n<ul>\n    <li>Zero cost：Free for all developer\n    </li><li>Extremely efficient：Get rid of past recurring deployment methods, plug-in automated deployment\n</li></ul>\n<h4>Three use scenarios, simple and convenient, get started quickly</h4>\n<ul>\n    <li>Deploy to ECS.There is no need to switch between Maven, Git, and other O&amp;M scripts and tools, and developers can configure it on a graphical interface to deploy applications to ECS in a sustainable and convenient manner.\n    </li><li>Deploy to EDAS.Enterprise Distributed Application Services EDAS is a PaaS platform for applications and microservices that offers a wide range of application delivery and lightweight microservice solutions. For Alibaba Cloud EDAS developers, local applications and cloud deployments have been opened on the plugin.\n    </li><li>Deploy to Kubernetes.Container Services Kubernetes Edition provides high-performance, scalable container application management capabilities that support full lifecycle management of enterprise-class Kubernetes containerized applications. For Alibaba Cloud Kubernetes developers, local applications and cloud deployments have been opened on the plugin.\n</li></ul>\n    ","tags":["Cloud Support"],"vendor":"Alibaba Cloud","version":"2020.8.2","notes":"\n<h3>[2020.8.2]</h3>\n<ul>\n<li> 【问题修复】</li>\n<li> 1、修复多个产品问题</li>\n<br>\n</ul>\n    ","dependencies":["org.jetbrains.plugins.terminal","org.jetbrains.plugins.yaml"],"optionalDependencies":["org.jetbrains.idea.maven","com.intellij.modules.java","com.intellij.modules.python","com.intellij.modules.ruby","com.intellij.modules.go","org.jetbrains.plugins.gradle","com.intellij.modules.webstorm","org.jetbrains.plugins.remote-run","com.jetbrains.php"],"since":"182.0","size":89346225}